In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import json
import io

# Import data from json file to dataframe

##### 1. load json files and convert to three dataframe

In [19]:
business_json_file = 'business.json'
user_json_file = 'user.json'
review_json_file = 'review.json'

In [21]:
business = []
user = []
review = []
for line in open(business_json_file, 'r'):
    business.append(json.loads(line))

In [22]:
for line in open(user_json_file, 'r'):
    user.append(json.loads(line))

In [35]:
for line in open(review_json_file, 'r'):
    review.append(json.loads(line))

In [36]:
business_df = pd.DataFrame.from_records(business)
user_df = pd.DataFrame.from_records(user)
review_df = pd.DataFrame.from_records(review)

In [26]:
business_df[6:8]

,address,attributes,business_id,categories,city,hours,is_open,latitude,longitude,name,postal_code,review_count,stars,state
6,20 Douglas Woods Drive Southeast,"{'RestaurantsPriceRange2': '2', 'BusinessParki...",5JucpCfHZltJh5r1JabjDg,"Beauty & Spas, Hair Salons",Calgary,None,1,50.943646,-114.001828,Edgeworxx Studio,T2Z 1K4,7,3.5,AB
7,"4545 E Tropicana Rd Ste 8, Tropicana","{'RestaurantsPriceRange2': '3', 'GoodForKids':...",gbQN7vr_caG_A1ugSmGhWg,"Hair Salons, Hair Stylists, Barbers, Men's Hai...",Las Vegas,"{'Monday': '10:0-19:0', 'Tuesday': '10:0-19:0'...",1,36.099872,-115.074574,Supercuts,89121,3,3.5,NV

In [24]:
user_df[:3]

,average_stars,compliment_cool,compliment_cute,compliment_funny,compliment_hot,compliment_list,compliment_more,compliment_note,compliment_photos,compliment_plain,...,cool,elite,fans,friends,funny,name,review_count,useful,user_id,yelping_since
0,4.03,1,0,1,2,0,0,1,0,1,...,25,"2015,2016,2017",5,"c78V-rj8NQcQjOI8KP3UEA, alRMgPcngYSCJ5naFRBz5g...",17,Rashmi,95,84,l6BmjZMeQD3rDxWUbiAiow,2013-10-08 23:11:33
1,3.63,1,0,1,1,0,0,0,0,0,...,16,,4,"kEBTgDvFX754S68FllfCaA, aB2DynOxNOJK9st2ZeGTPg...",22,Jenna,33,48,4XChL029mKr5hydo79Ljxg,2013-02-21 22:29:06
2,3.71,0,0,0,0,0,0,1,0,0,...,10,,0,"4N-HU_T32hLENLntsNKNBg, pSY2vwWLgWfGVAAiKQzMng...",8,David,16,28,bc8C_eETBWL0olvFSJJd0w,2013-10-04 00:16:10

In [39]:
review_df[:3]

,business_id,cool,date,funny,review_id,stars,text,useful,user_id
0,ujmEBvifdJM6h6RLv4wQIg,0,2013-05-07 04:34:36,1,Q1sbwvVQXV2734tPgoKj4Q,1.0,Total bill for this horrible service? Over $8G...,6,hG7b0MtEbXx5QzbzE6C_VA
1,NZnhc2sEQy3RmzKTZnqtwQ,0,2017-01-14 21:30:33,0,GJXCdrto3ASJOqKeVWPi6Q,5.0,I *adore* Travis at the Hard Rock's new Kelly ...,0,yXQM5uF2jS6es16SJzNHfg
2,WTqjgwHlXbSFevF32_DJVw,0,2016-11-09 20:09:03,0,2TzJjDVDEuAW6MR5Vuc1ug,5.0,I have to say that this office really has it t...,3,n6-Gk65cPZL6Uz8qRm3NYw

# Exploratary Data Analysis

### 1.business analytics

In [33]:
business_df_stars = business_df.groupby('stars').count()
business_df_stars[0:3]

,address,attributes,business_id,categories,city,hours,is_open,latitude,longitude,name,postal_code,review_count,state
stars,,,,,,,,,,,,,
1.0,4874,2458,4874,4713,4874,2499,4874,4874,4874,4874,4874,4874,4874
1.5,4976,3658,4976,4908,4976,2911,4976,4976,4976,4976,4976,4976,4976
2.0,11426,9111,11426,11373,11426,7283,11426,11426,11426,11426,11426,11426,11426
2.5,18843,15284,18843,18754,18843,12808,18843,18843,18843,18843,18843,18843,18843
3.0,25996,23118,25996,25969,25996,18849,25996,25996,25996,25996,25996,25996,25996

#### visualize the stars

### 2.User analytics

### 3.Review Analytics

# Get some test data (review)

In [40]:
business_test = business_df[:100]
review_test = review_df[:100]
user_test = user_df[:100]

# Sentiment Analysis (review)

In [41]:
from nltk.tokenize import word_tokenize, RegexpTokenizer